package app

import(
	l4g "github.com/alecthomas/log4go"
)

var catos = []string{ "甲亢","乙肝","胃炎","高血脂","脑梗塞","癫痫","强直性脊柱炎","痛风","哮喘","肺结核", "胃溃疡", "克罗恩病", "肝硬化", "脑梗塞", "癫痫", "面瘫", "三叉神经痛", "老年痴呆", "脑血栓形成", "帕金森病", "脑供血不足", "失眠", "面肌抽搐", "重症肌无力", "高尿酸血症", "痛风", "甲状腺炎", "糖尿病足", "肥胖症", "低血糖", "甲减", "强直性脊柱炎", "风湿病", "类风湿性关节炎", "干燥综合征", "特发性关节痛综合征", "硬皮病", "系统性红斑狼疮", "白塞病", "外科常见病", "前列腺炎", "肺癌", "痔疮", "甲状腺腺瘤", "直肠癌", "肾结石", "结肠癌", "胆囊结石", "胃癌", "食管癌", "胆囊癌", "肝血管瘤", "早泄", "肾结石", "包皮过长", "性功能障碍", "男性不育症", "尿路感染", "前列腺增生", "前列腺癌", "肾积水", "乳腺增生", "乳腺纤维腺瘤", "乳腺腺病", "急性乳腺炎", "多乳房", "乳腺导管扩张症", "胃癌", "甲状腺腺瘤", "胰腺炎", "甲状腺癌", "胰腺癌", "脂肪瘤", "甲状腺结节样病变", "阑尾炎", "胰腺囊肿", "脾大", "肝肿瘤", "胆囊结石", "胆囊息肉", "肝血管瘤", "胆囊炎", "胆管结石", "胆管癌", "肝腹水", "胆囊癌", "胆总管结石", "宫颈癌", "月经不调", "输卵管堵塞", "阴道炎", "多囊卵巢综合征", "围绝经期综合征", "宫颈炎", "盆腔炎", "子宫内膜异位症", "子宫内膜增生", "宫外孕", "子宫腺肌症", "产后出血", "早产", "自然流产", "巧克力囊肿", "子宫脱垂", "宫颈癌前病变", "子宫颈息肉", "畸胎瘤", "卵巢癌", "子宫内膜息肉", "子宫内膜癌", "尖锐湿疣", "腋臭", "灰指甲", "胎记", "扁平疣", "带状疱疹", "甲沟炎", "黑色素瘤", "脂溢性皮炎", "梅毒", "寻常痤疮", "毛囊炎", "皮肤瘙痒症", "神经性皮炎", "外阴黏膜白斑", "表皮痣", "皮炎", "色素痣", "生殖器疱疹", "鱼鳞病", "脚气", "寻常疣", "骨质增生", "肩周炎", "腱鞘炎", "半月板损伤", "滑膜炎", "关节炎", "慢性腰背痛", "股骨头缺血性坏死", "骨折", "颈椎间盘突出症", "慢性腰背痛", "颈椎间盘突出症", "腰椎椎管狭窄症", "脊髓型颈椎病", "神经根型颈椎病", "脊柱骨折", "脊柱肿瘤", "肩周炎", "半月板损伤", "滑膜炎", "痛风性关节炎", "肩袖损伤", "肱骨外上髁炎", "骨关节炎", "先天性髋关节脱位", "肌腱炎", "骨折", "跟腱炎", "半月板撕裂", "跟腱断裂", "腓总神经损伤", "髌骨骨折", "股骨颈骨折", "踝关节骨折", "膝外侧韧带损伤", "鼻炎", "鼻窦炎", "中耳炎", "三叉神经痛", "鼻咽癌", "鼻中隔偏曲", "扁桃体炎", "鼻息肉", "声带息肉", "美尼尔综合症", "急性鼻炎", "喉癌", "鼓膜穿孔", "咽异感症", "慢性咽炎", "白内障", "青光眼", "近视", "弱视", "结膜炎", "黄斑变性", "玻璃体混浊", "斜视", "角膜炎", "视网膜脱落", "散光", "葡萄膜炎", "睑腺炎", "沙眼", "视神经炎", "甲状腺癌", "腮腺炎", "咽部肿瘤", "颈动脉瘤", "心肌炎", "心律失常", "心肌缺血", "房颤", "心脏神经症", "扩张型心肌病", "肺心病", "风湿性心脏病", "小儿哮喘", "小儿癫痫", "小儿抽动症", "小儿支气管肺炎", "小儿原发性肾病综合征", "唐氏综合征", "先天性斜颈", "牙周炎", "龋齿", "牙龈炎", "口腔扁平苔藓", "牙齿磨损", "牙髓炎", "颞下颌关节紊乱综合征", "口腔癌", "口腔黏膜白斑", "抑郁症", "小儿多动症", "焦虑症", "强迫性障碍", "精神分裂症", "心理障碍", "产后抑郁症", "神经衰弱"}
func GetExpertFromGuaHao( ) {
	url := `https://www.guahao.com`
	l4g.Error(url)
	respBody, err := httpGet(url, false)
	if err != nil {
		l4g.Error("error:", url)
		return
	}
	l4g.Error("respBody", respBody)
}